MPU Messenger/MPU Messenger/bin/Debug/MPU Mesajları/MPU To Client Seventh Message.txt

    <?xml
        version="1.0"
        encoding="UTF-8"
        ?>
    <SOAP-ENV:Envelope
        xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
        xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:ns1="http://transport.alstom.com/webservices/tracesNotification"
        xmlns:ns2="urn:WEB-TRCNTF"
        xmlns:ns3="urn:WEB-COMMON"
        xmlns:ALS-FAULT="http://transport.alstom.com/webservices/Faults">
        <SOAP-ENV:Body>
            <ns2:DashboardDataNotification>
                <oDashData
                    xsi:type="ns2:DashData">
                    <dashId
                        xsi:type="xsd:int">
                        16777253
                        </dashId>
                    <rqstDate
                        xsi:type="xsd:dateTime">
                        2023-10-06T15:43:59.839144Z
                        </rqstDate>
                    <nbVar
                        xsi:type="xsd:int">
                        14
                        </nbVar>
                    <oTabVarData
                        xsi:type="ns3:varData">
                        <ns3:varId
                            xsi:type="xsd:int">
                            25166000
                            </ns3:varId>
                        <ns3:oVarType
                            xsi:type="ns3:VarType">
                            TBOOL
                            </ns3:oVarType>
                        <ns3:tabSize
                            xsi:type="xsd:int">
                            1
                            </ns3:tabSize>
                        <ns3:asciiData
                            xsi:type="xsd:string">
                            1
                            </ns3:asciiData>
                        </oTabVarData>
                    <oTabVarData
                        xsi:type="ns3:varData">
                        <ns3:varId
                            xsi:type="xsd:int">
                            25166001
                            </ns3:varId>
                        <ns3:oVarType
                            xsi:type="ns3:VarType">
                            TBOOL
                            </ns3:oVarType>
                        <ns3:tabSize
                            xsi:type="xsd:int">
                            1
                            </ns3:tabSize>
                        <ns3:asciiData
                            xsi:type="xsd:string">
                            0
                            </ns3:asciiData>
                        </oTabVarData>
                    <oTabVarData
                        xsi:type="ns3:varData">
                        <ns3:varId
                            xsi:type="xsd:int">
                            25166002
                            </ns3:varId>
                        <ns3:oVarType
                            xsi:type="ns3:VarType">
                            TBOOL
                            </ns3:oVarType>
                        <ns3:tabSize
                            xsi:type="xsd:int">
                            1
                            </ns3:tabSize>
                        <ns3:asciiData
                            xsi:type="xsd:string">
                            1
                            </ns3:asciiData>
                        </oTabVarData>
                    <oTabVarData
                        xsi:type="ns3:varData">
                        <ns3:varId
                            xsi:type="xsd:int">
                            25166003
                            </ns3:varId>
                        <ns3:oVarType
                            xsi:type="ns3:VarType">
                            TBOOL
                            </ns3:oVarType>
                        <ns3:tabSize
                            xsi:type="xsd:int">
                            1
                            </ns3:tabSize>
                        <ns3:asciiData
                            xsi:type="xsd:string">
                            1
                            </ns3:asciiData>
                        </oTabVarData>
                    <oTabVarData
                        xsi:type="ns3:varData">
                        <ns3:varId
                            xsi:type="xsd:int">
                            25166004
                            </ns3:varId>
                        <ns3:oVarType
                            xsi:type="ns3:VarType">
                            TBOOL
                            </ns3:oVarType>
                        <ns3:tabSize
                            xsi:type="xsd:int">
                            1
                            </ns3:tabSize>
                        <ns3:asciiData
                            xsi:type="xsd:string">
                            1
                            </ns3:asciiData>
                        </oTabVarData>
                    <oTabVarData
                        xsi:type="ns3:varData">
                        <ns3:varId
                            xsi:type="xsd:int">
                            25166005
                            </ns3:varId>
                        <ns3:oVarType
                            xsi:type="ns3:VarType">
                            TBOOL
                            </ns3:oVarType>
                        <ns3:tabSize
                            xsi:type="xsd:int">
                            1
                            </ns3:tabSize>
                        <ns3:asciiData
                            xsi:type="xsd:string">
                            1
                            </ns3:asciiData>
                        </oTabVarData>
                    <oTabVarData
                        xsi:type="ns3:varData">
                        <ns3:varId
                            xsi:type="xsd:int">
                            25166006
                            </ns3:varId>
                        <ns3:oVarType
                            xsi:type="ns3:VarType">
                            TBOOL
                            </ns3:oVarType>
                        <ns3:tabSize
                            xsi:type="xsd:int">
                            1
                            </ns3:tabSize>
                        <ns3:asciiData
                            xsi:type="xsd:string">
                            0
                            </ns3:asciiData>
                        </oTabVarData>
                    <oTabVarData
                        xsi:type="ns3:varData">
                        <ns3:varId
                            xsi:type="xsd:int">
                            25165998
                            </ns3:varId>
                        <ns3:oVarType
                            xsi:type="ns3:VarType">
                            TBOOL
                            </ns3:oVarType>
                        <ns3:tabSize
                            xsi:type="xsd:int">
                            1
                            </ns3:tabSize>
                        <ns3:asciiData
                            xsi:type="xsd:string">
                            0
                            </ns3:asciiData>
                        </oTabVarData>
                    <oTabVarData
                        xsi:type="ns3:varData">
                        <ns3:varId
                            xsi:type="xsd:int">
                            25166007
                            </ns3:varId>
                        <ns3:oVarType
                            xsi:type="ns3:VarType">
                            TBOOL
                            </ns3:oVarType>
                        <ns3:tabSize
                            xsi:type="xsd:int">
                            1
                            </ns3:tabSize>
                        <ns3:asciiData
                            xsi:type="xsd:string">
                            1
                            </ns3:asciiData>
                        </oTabVarData>
                    <oTabVarData
                        xsi:type="ns3:varData">
                        <ns3:varId
                            xsi:type="xsd:int">
                            25165985
                            </ns3:varId>
                        <ns3:oVarType
                            xsi:type="ns3:VarType">
                            TBOOL
                            </ns3:oVarType>
                        <ns3:tabSize
                            xsi:type="xsd:int">
                            1
                            </ns3:tabSize>
                        <ns3:asciiData
                            xsi:type="xsd:string">
                            1
                            </ns3:asciiData>
                        </oTabVarData>
                    <oTabVarData
                        xsi:type="ns3:varData">
                        <ns3:varId
                            xsi:type="xsd:int">
                            25165986
                            </ns3:varId>
                        <ns3:oVarType
                            xsi:type="ns3:VarType">
                            TBOOL
                            </ns3:oVarType>
                        <ns3:tabSize
                            xsi:type="xsd:int">
                            1
                            </ns3:tabSize>
                        <ns3:asciiData
                            xsi:type="xsd:string">
                            1
                            </ns3:asciiData>
                        </oTabVarData>
                    <oTabVarData
                        xsi:type="ns3:varData">
                        <ns3:varId
                            xsi:type="xsd:int">
                            25166008
                            </ns3:varId>
                        <ns3:oVarType
                            xsi:type="ns3:VarType">
                            TBOOL
                            </ns3:oVarType>
                        <ns3:tabSize
                            xsi:type="xsd:int">
                            1
                            </ns3:tabSize>
                        <ns3:asciiData
                            xsi:type="xsd:string">
                            1
                            </ns3:asciiData>
                        </oTabVarData>
                    <oTabVarData
                        xsi:type="ns3:varData">
                        <ns3:varId
                            xsi:type="xsd:int">
                            25166009
                            </ns3:varId>
                        <ns3:oVarType
                            xsi:type="ns3:VarType">
                            TBOOL
                            </ns3:oVarType>
                        <ns3:tabSize
                            xsi:type="xsd:int">
                            1
                            </ns3:tabSize>
                        <ns3:asciiData
                            xsi:type="xsd:string">
                            1
                            </ns3:asciiData>
                        </oTabVarData>
                    <oTabVarData
                        xsi:type="ns3:varData">
                        <ns3:varId
                            xsi:type="xsd:int">
                            25166010
                            </ns3:varId>
                        <ns3:oVarType
                            xsi:type="ns3:VarType">
                            TBOOL
                            </ns3:oVarType>
                        <ns3:tabSize
                            xsi:type="xsd:int">
                            1
                            </ns3:tabSize>
                        <ns3:asciiData
                            xsi:type="xsd:string">
                            1
                            </ns3:asciiData>
                        </oTabVarData>
                    </oDashData>
                </ns2:DashboardDataNotification>
            </SOAP-ENV:Body>
        </SOAP-ENV:Envelope>
